% % aco=[]
% % 
% % x=0:1:6;
% % plot(x,x,'m-*');hold on;
% % plot(x,x,'b:');
%  tau_best=[1 2 3 4 5];
%  t=(1:1:5);
%  %axis([-1,4,0,5]); %放figure前不行
%  figure,plot(t,tau_best(t)),title('目标函数每次迭代最值(所有蚂蚁中)变化历程');hold on;
%  axis([-1,4,0,5]);
%  text(3,tau_best(3),num2str(3));
%  plot([1,5],[2,2]);
%  %axis([-1,4,0,5]);
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% 
% figure,plot([2 3 4 5 6 7],[80.4552 91.5191 98.0186 102.2861 143.6092 180.0916],'m-*'),title('本文算法和平均分配算法得出目标函数值的对比图');hold on;
% plot([2 3 4 5 6 7],[86.3879 114.1446 133.4032 162.8139 178.0810 197.1775],'b-o');
% xlabel('节点数/划分子任务数')
% ylabel('时延能耗综合目标函数')
% legend('ACO+ALMM','EA','location','southeast');

% figure,plot([4 5 6 7 8 9 ],[51.8215 56.9457 63.0576 62.2159 79.5432 88.7562],'m-*'),title('本文算法与其它算法得出目标函数值的对比图');hold on;
% plot([4 5 6 7 8 9],[61.7134 64.2597 72.6700 77.1805 82.5254 93.2681],'b-o');hold on;
% plot([4 5 6 7 8 9],[62.5024 81.7310 152.8569 120.0340 221.9024 169.0327],'k-.');hold on;
% xlabel('节点数/划分子任务数')
% ylabel('时延能耗综合目标函数')
% legend('ACO+ALMM','EA','RA','location','northwest');

%%%%%%%%%%%%%%%%%%%%%%%%分布不均的情况【4,16】
% figure,plot([4 5 6 7 8 9 ],[60.3358 75.5686 84.2173 72.4216 64.5128 76.6753],'m-*'),title('本文算法与其它算法得出目标函数值的对比图');hold on;
% plot([4 5 6 7 8 9],[82.3317 82.0700 98.6686 88.5198 87.8477 95.4748],'b-o');hold on;
% plot([4 5 6 7 8 9],[85.2212 82.4888 109.9873 186.4002 381.9620 518.4923],'k-.');hold on;
% xlabel('节点数/划分子任务数')
% ylabel('时延能耗综合目标函数')
% legend('ACO+ALMM','EA','RA','location','northwest');
%  
% figure,plot([4 5 6 7 8 9 10],[60.1146 46.8483 68.3236 72.4216 64.5128 77.9374 77.6289],'m-*'),title('本文算法与其它算法得出目标函数值的对比图');hold on;
% plot([4 5 6 7 8 9 10],[86.1167 70.0250 91.4375 88.5198 87.8477 103.5892 86.5779],'b-o');hold on;
% plot([4 5 6 7 8 9 10],[118.5390 97.9182 93.8267 186.4002 381.9620 467.5759 380.4312],'k-.');hold on;
% xlabel('节点数/划分子任务数')
% ylabel('时延能耗综合目标函数')
% legend('ACO+ALMM','EA','RA','location','northwest');
figure,plot([4 5 6 7 8 9 10 11 12],[60.1146 46.8483 68.3236 72.4216 64.5128 77.9374 103.3789 93.0729 86.9538],'m-*'),title('本文算法与其它算法得出目标函数值的对比图');hold on;
plot([4 5 6 7 8 9 10 11 12],[86.1167 70.0250 91.4375 88.5198 87.8477 103.5892 118.4917 110.8911 118.6699],'b-o');hold on;
plot([4 5 6 7 8 9 10 11 12],[118.5390 97.9182 93.8267 186.4002 381.9620 467.5759 134.1499 178.0587 193.2846],'k-.');hold on;
xlabel('节点数/划分子任务数')
ylabel('时延能耗综合目标函数')
legend('ACO+ALMM','EA','RA','location','northwest');